[
    {
        "id": 1,
        "image": "https://media.licdn.com/dms/image/D560BAQEPTyzhqoLvLg/company-logo_100_100/0/1692017747677?e=1703116800&v=beta&t=IVN4mNtTCEvO7AipOSWfr_lnpnGPSbFKlXv8eNf0Ly8",
        "companyName": "Avionos, A Hero Digital Company",
        "title": "Senior Software Engineer",
        "location": "Chicago, IL",
        "startDate": "MAR 2022", 
        "endDate": "Present",
        "description": [
            "<b>Constructed</b> a compendium of reusable UI components using JavaScript, HTML, and CSS; standardized frontend development practices, resulting in faster project turnarounds and consistent user interfaces.",
            "<b>Transformed</b> UX designs into a functional, branded front-end portal on Salesforce Experience Cloud using modern web development practices; enhanced user experience and brand consistency across the platform.",
            "<b>Managed and mentored</b> junior developers through pull request reviews, onboarding documentation, and detailed technical designs; improved code quality and accelerated the onboarding process for new team members."
        ],
        "skills": [
            "Lightning Web Components",
            "Salesforce Apex Development",
            "Bitbucket Pipelines"
        ],
        "link" : "https://www.avionos.com/"
    },
    {
        "id": 2,
        "image": "https://media.licdn.com/dms/image/D560BAQFeC7XvJhgEZg/company-logo_100_100/0/1689352060538?e=1703116800&v=beta&t=Q87PsfGfN7Zu7v0OQxFKD_xOfiK0vFdnIH5MvmYjiFo",
        "companyName": "Accenture Federal Services",
        "title": "Senior Software Engineer",
        "location": "Cleveland, OH",
        "startDate": "AUG 2021",
        "endDate": "MAR 2022",
        "description": [
            "<b>Led backend development</b> for a Salesforce Experience Cloud website aimed at streamlining volunteer management; designed system architecture, page layouts, and user flows, resulting in a more efficient interaction between volunteers and managers.",
            "<b>Mentored junior developers</b> and conducted knowledge sessions; elevated team skills and ensured best practices in development workflows.",
            "<b>Implemented</b> a robust DevOps solution using Microsoft Azure; enhanced deployment speed and system reliability, streamlining the software development lifecycle."
        ],
        "skills": [
            "Azure DevOps Services",
            "Lightning Web Components",
            "SF Experience Cloud"
        ],
        "link" : "https://www.accenture.com/us-en/industries/afs-index"
    },
    {
        "id": 3,
        "image": "https://media.licdn.com/dms/image/C4D0BAQHX8aSghBvCtg/company-logo_100_100/0/1612214249947?e=1703116800&v=beta&t=haDjozZm-9ELhmWbJlk5iiTl6kZKVYWm7yh0Vd90x0w",
        "companyName": "Acumen, A Salesforce Company",
        "title": "Technical Consultant II",
        "location": "Cleveland, OH",
        "startDate": "MAY 2019",
        "endDate": "JULY 2021",
        "description": [
            "<b>Led UI development</b> for an employee-facing mobile app using Ionic and Angular, streamlining order tracking and boosting product search capabilities.",
            "<b>Lead Developer</b> on an Angular Ionic app for client employees, mentored a junior developer, and increased Jasmine test code coverage to >90%; improved workplace safety through real-time hazard reporting features.",
            "<b>Managed backend maintenance</b> for a Salesforce invoicing application, visualized complex Apex logic, and enhanced system stability; provided clearer insights for future teams and clients",
            "<b>Participated</b> in a specialized UI/UX team, developing modular, reusable UI components for Salesforce Experience Cloud, maintained high Jest code coverage; expedited feature development for other teams while ensuring UI consistency.",
            "<b>Involved</b> in numerous internal projects, developed and maintained several applications using Angular and React; increased productivity for internal employees."
        ],
        "skills": [
            "ReactJS",
            "Salesforce",
            "NodeJS",
            "Angular",
            "Lightning Web Components"
        ],
        "link" : "https://www.linkedin.com/company/acumen-solutions/"
    }
]